# Conexão com postgres e Relatorios do Sistema

## Instalando biblioteca de acesso com postgres e manipulação de dados e gráficos

In [3]:
!pip install --user psycopg2-binary
!pip install --user seaborn
!pip install --user pandas

Requirement already satisfied: psycopg2-binary in c:\users\marcelo\appdata\roaming\python\python36\site-packages (2.7.6.1)
Requirement already satisfied: seaborn in c:\users\marcelo\appdata\roaming\python\python36\site-packages (0.9.0)
Requirement already satisfied: numpy>=1.9.3 in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from seaborn) (1.15.4)
Requirement already satisfied: pandas>=0.15.2 in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from seaborn) (0.23.4)
Requirement already satisfied: matplotlib>=1.4.3 in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from seaborn) (3.0.2)
Requirement already satisfied: scipy>=0.14.0 in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from seaborn) (1.1.0)
Requirement already satisfied: pytz>=2011k in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from pandas>=0.15.2->seaborn) (2018.7)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from pandas>=0.15.2->seaborn) (2.7.5)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from matplotlib>=1.4.3->seaborn) (1.0.1)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from matplotlib>=1.4.3->seaborn) (2.3.0)
Requirement already satisfied: cycler>=0.10 in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from matplotlib>=1.4.3->seaborn) (0.10.0)
Requirement already satisfied: six>=1.5 in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from python-dateutil>=2.5.0->pandas>=0.15.2->seaborn) (1.11.0)
Requirement already satisfied: setuptools in c:\users\marcelo\appdata\local\programs\python\python36-32\lib\site-packages (from kiwisolver>=1.0.1->matplotlib>=1.4.3->seaborn) (39.1.0)
Requirement already satisfied: pandas in c:\users\marcelo\appdata\roaming\python\python36\site-packages (0.23.4)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from pandas) (2.7.5)
Requirement already satisfied: pytz>=2011k in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from pandas) (2018.7)
Requirement already satisfied: numpy>=1.9.0 in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from pandas) (1.15.4)
Requirement already satisfied: six>=1.5 in c:\users\marcelo\appdata\roaming\python\python36\site-packages (from python-dateutil>=2.5.0->pandas) (1.11.0)

### Importando bibliotecas

In [4]:
import seaborn as sns
import pandas as pd
import psycopg2

In [ ]:
### Usando psycopg2 para configurar conexão

In [7]:
conn = psycopg2.connect(host="elmer.db.elephantsql.com",database="ftraczzx", user="ftraczzx", password="olxVdZ2hyXhG1r3tK6oHCghMdefy4imh")

## Obtendo dados do database com Pandas

# Relatório 1

### Obejtivo: Exibir quais especies de peixes estão em quais tanques no momento atual e o tipo da água

In [8]:
tanque = pd.read_sql_query("""
                           select idtanque,nomecientifico,tipoagua from tanque 
                               inner join peixe on(tanque.fk_peixe_idpeixe=peixe.idpeixe)
                               ;
                           
                          """,conn)
tanque

   idtanque nomecientifico tipoagua
0         0           none     none
1         1        tilapia     doce
2         2        dourado     doce
3         3        tilapia     doce
4         4        dourado     doce
5         5        tilapia     doce

# Relatorio 2

### Objetivo: Mostrar estado atual de um tanque e quais dados  estão fora do esperado

In [9]:
tanque = pd.read_sql_query("""
                           select * from tanque 
                               inner join peixe on(tanque.fk_peixe_idpeixe=peixe.idpeixe);
                           
                          """,conn)
tanque

,idtanque,temperatura,ph,oxigenio,fk_peixe_idpeixe,idpeixe,nomecientifico,tipoagua,tempmin,tempmax,phmin,phmax,oxmin,oxmax
0,0,0.0,0.0,0.0,0,0,none,none,0.0,0.0,0.0,0.0,0.0,0.0
1,1,30.5,6.2,7.2,1,1,tilapia,doce,27.0,32.0,6.0,8.5,5.0,10.0
2,2,30.4,6.9,5.5,2,2,dourado,doce,22.0,28.0,6.5,8.0,4.0,10.0
3,3,30.1,6.9,6.2,1,1,tilapia,doce,27.0,32.0,6.0,8.5,5.0,10.0
4,4,30.3,6.8,6.3,2,2,dourado,doce,22.0,28.0,6.5,8.0,4.0,10.0
5,5,30.5,7.2,7.1,1,1,tilapia,doce,27.0,32.0,6.0,8.5,5.0,10.0

# Relatorio 3

### Objetivo mostrar quais funcionarios estão responsaveis por quais tanques

In [11]:
result = pd.read_sql_query("""SELECT nome as funcionario,idtanque as tanque
                              FROM  funcionario inner join tanque on(tanque.idtanque=funcionario.fk_tanque_idtanque)
                              where idtanque!=0;                          
                          """,conn);
result

  funcionario  tanque
0     marcelo       1
1     gandalf       2
2       andre       3
3     joaquim       4
4       bilbo       5
5     boromir       1
6     aragorn       2
7     legolas       3
8     tauriel       4
9       frodo       5

# Relatório 4

### Obejtivo Um histórico dos Tanques, com base nos funcionários.

In [16]:
result = pd.read_sql_query("""SELECT nome,cpf,idtanque, medicao.temperatura,medicao.ph,medicao.oxigenio,nomecientifico,tipoagua,hora,data
                          FROM  funcionario inner join tanque on(tanque.idtanque=funcionario.fk_tanque_idtanque)
                          inner join peixe on (tanque.fk_peixe_idpeixe=peixe.idpeixe)
                          inner join medicao on (medicao.fk_tanque_idtanque=tanque.idtanque)
                          where (fk_turno_idturno=1) 
                          order by(hora,data);
                          """,conn);
result

,nome,cpf,idtanque,temperatura,ph,oxigenio,nomecientifico,tipoagua,hora,data
0,joaquim,12331622510,4,33.0,7.0,8.6,dourado,doce,08:30:00,2018-01-28
1,marcelo,14730683714,1,34.0,7.5,8.9,tilapia,doce,08:30:00,2018-01-28
2,bilbo,98753612345,5,34.0,7.5,8.9,tilapia,doce,08:30:00,2018-01-28
3,gandalf,74731683511,2,33.0,7.0,8.6,dourado,doce,08:30:00,2018-01-28
4,andre,71131683510,3,34.0,7.5,8.9,tilapia,doce,08:30:00,2018-01-28
5,joaquim,12331622510,4,33.1,7.1,8.8,dourado,doce,09:30:00,2018-01-28
6,andre,71131683510,3,34.1,7.6,8.8,tilapia,doce,09:30:00,2018-01-28
7,gandalf,74731683511,2,33.1,7.1,8.8,dourado,doce,09:30:00,2018-01-28
8,bilbo,98753612345,5,34.1,7.6,8.8,tilapia,doce,09:30:00,2018-01-28
9,marcelo,14730683714,1,34.1,7.6,8.8,tilapia,doce,09:30:00,2018-01-28
10,andre,71131683510,3,34.3,7.7,8.7,tilapia,doce,10:30:00,2018-01-28
11,marcelo,14730683714,1,34.3,7.7,8.7,tilapia,doce,10:30:00,2018-01-28
12,gandalf,74731683511,2,32.3,7.5,8.6,dourado,doce,10:30:00,2018-01-28
13,joaquim,12331622510,4,32.3,7.5,8.6,dourado,doce,10:30:00,2018-01-28
14,bilbo,98753612345,5,34.3,7.7,8.7,tilapia,doce,10:30:00,2018-01-28
15,bilbo,98753612345,5,34.4,7.8,8.7,tilapia,doce,11:30:00,2018-01-28
16,marcelo,14730683714,1,34.4,7.8,8.7,tilapia,doce,11:30:00,2018-01-28
17,joaquim,12331622510,4,34.4,7.1,8.6,dourado,doce,11:30:00,2018-01-28
18,andre,71131683510,3,34.4,7.8,8.7,tilapia,doce,11:30:00,2018-01-28
19,gandalf,74731683511,2,34.4,7.1,8.6,dourado,doce,11:30:00,2018-01-28
20,andre,71131683510,3,35.5,7.9,8.5,tilapia,doce,12:30:00,2018-01-28
21,joaquim,12331622510,4,33.5,7.1,8.5,dourado,doce,12:30:00,2018-01-28
22,marcelo,14730683714,1,35.5,7.9,8.5,tilapia,doce,12:30:00,2018-01-28
23,bilbo,98753612345,5,35.5,7.9,8.5,tilapia,doce,12:30:00,2018-01-28
24,gandalf,74731683511,2,33.5,7.1,8.5,dourado,doce,12:30:00,2018-01-28

# Relatório 5

### mostrar dados  de informções  de contato dos funcionarios

In [14]:
result =pd.read_sql_query("""
                SELECT nome,cpf,cidade,bairro,logradouro,cep,dado as telefone FROM  funcionario inner join endereco on (endereco.fk_funcionario_idfuncionario=funcionario.idfuncionario)
                    inner join contato on (contato.fk_funcionario_idfuncionario=funcionario.idfuncionario)
                    where 	fk_tipocontato_idtipo=2;
                            """,conn)
result

,nome,cpf,cidade,bairro,logradouro,cep,telefone
0,marcelo,14730683714,vila velha,soteco,rua visconde de taunay,29106080,33394433
1,gandalf,74731683511,vila velha,cocal,rua cravos verdes,29106090,33393191
2,andre,71131683510,vila velha,cocal,rua laranja mecanica,29106100,33323987
3,joaquim,12331622510,vila velha,soteco,rua dos alfaiates,29106110,33393123
4,bilbo,98753612345,middle earth,cocal,rua ponei saltitante,29106111,33393789
5,lucca,98753612655,vila velha,itapua,rua abacate doce,29106101,32569874
6,boromir,24730683714,middle earth,harehal,rua dos alfaiates,29106111,32569811
7,aragorn,23731683511,middle earth,condado,rua ponei saltitante,29106121,33304499
8,legolas,32131683510,middle earth,harehal,rua dos alfaiates,29106111,30334148
9,tauriel,32331622510,middle earth,condado,rua ponei saltitante,29106121,38985689
10,frodo,98246612345,middle earth,harehal,rua dos alfaiates,29106111,30313459

# Referencias

https://pandas.pydata.org/pandas-docs/stable/style.html <br>
https://pythonspot.com/matplotlib-bar-chart/<br>
https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.loc.html <br>